import { apiUrl } from "./ApiUrl";

export async function getPosts() {
  try {
    let res = await fetch(`${apiUrl}/posts`, {
      next: { revalidate: 3600 },
    });

    if (!res.ok) {
      throw new Error(`خطا در دریافت پست‌ها: ${res.status}`);
    }

    let posts = await res.json();
    if (!posts || posts.length === 0) {
      return []; // بازگشت آرایه خالی به جای notFound
    }
    return posts;
  } catch (error) {
    console.error("خطا در دریافت پست‌ها:", error);
    return []; // یا مقدار پیش‌فرض
  }
}
export const whyusdata = {
  maindata: {
    title: "سفارش طراحی سایت ارزان و با کیفیت در سراسر تهران و ایران",
    content:
      "شرکت یونیکد با افتخار خدمات سفارش طراحی سایت ارزان را به مشتریان خود ارائه می‌دهد. اگر به دنبال یک طراحی حرفه‌ای و باکیفیت با قیمت مناسب هستید، یونیکد بهترین گزینه برای شماست. تیم ما متشکل از طراحان و برنامه‌نویسان با تجربه است که با استفاده از آخرین فناوری‌ها و استانداردهای روز، وب‌سایتی منحصر به فرد و کاربرپسند برای شما طراحی می‌کنند.",
    img: "/image/design-team.jpg",
  },
  storedata: [
    {
      title: "طراحی سایت فروشگاهی",
      content:
        "یونیکد تخصص ویژه‌ای در طراحی سایت‌های فروشگاهی دارد. ما با ارائه پلتفرم‌هایی که کاربری آسان دارند و قابلیت‌های پرداخت آنلاین، به شما کمک می‌کنیم تا کسب و کار خود را به راحتی به دنیای دیجیتال منتقل کنید. طراحی‌های ما همواره واکنش‌گرا بوده و بهترین تجربه کاربری را به مشتریان شما ارائه می‌دهد.",
      img: "/image/eCommerce-website-developer.jpg",
    },
  ],
  companydata: [
    {
      title: "طراحی سایت شرکتی",
      content:
        "سایت‌های شرکتی طراحی شده توسط یونیکد، برند شما را به بهترین شکل ممکن نمایش می‌دهند. از ویژگی‌های منحصر به فرد طراحی‌های ما می‌توان به واکنش‌گرایی، بهینه‌سازی برای موتورهای جستجو و امنیت بالا اشاره کرد. طراحی سایت شرکتی خود را به ما بسپارید و از نتایج فوق‌العاده لذت ببرید.",
      img: "/image/companywebdesign.jpg",
    },
  ],
  resumedata: [
    {
      title: "طراحی سایت شخصی و رزومه‌ای",
      content:
        "اگر به دنبال نمایش توانمندی‌ها و مهارت‌های خود به صورت آنلاین هستید، یونیکد با طراحی سایت‌های شخصی و رزومه‌ای حرفه‌ای، به شما کمک می‌کند تا هویت آنلاین خود را به بهترین شکل ممکن بسازید. سایت‌هایی که برای شما طراحی می‌کنیم سریع، امن و کاملاً بهینه برای موتورهای جستجو هستند.",
      img: "/image/resumeweb.jpg",
    },
  ],
};

export const infocomment = [
  {
    id: 3,
    title: "سرعت و کیفیت بالا",
    comment:
      "طراحی سایت شرکتی ما با این تیم بسیار عالی بود. آنها با دقت و حرفه‌ای‌گری تمامی نیازهای ما را پیاده‌سازی کردند. نتیجه نهایی یک سایت زیبا و کاربردی است و پشتیبانی آنها نیز بسیار عالی بود.",
    name: "سحر نادری",
    sitename: "شرکت میهن سازه",
  },
  {
    id: 4,
    title: "تجربه‌ای لذت‌بخش",
    comment:
      "همکاری با این تیم در طراحی سایت بسیار لذت‌بخش بود. آنها به جزئیات توجه کرده و طراحی سایت را به گونه‌ای انجام دادند که کاملاً با برند ما هماهنگ است. سرعت عمل و کیفیت کار آنها بسیار عالی بود.",
    name: "علی عابدی",
    sitename: "فریلنسرکار",
  },
  {
    id: 5,
    title: "پشتیبانی فوق‌العاده",
    comment:
      "طراحی سایت من توسط این تیم بسیار خوب انجام شد و پشتیبانی پس از طراحی فوق‌العاده بود. هر بار که مشکلی پیش می‌آمد، تیم به سرعت و با دقت عمل می‌کرد. طراحی سایت کاربرپسند و مطابق با استانداردهای روز بود.",
    name: "مریم سلیمانی",
    sitename: "نیلی شاپ",
  },
  {
    id: 6,
    title: "خدمات بی‌نظیر",
    comment:
      "طراحی سایت توسط این تیم به طور کامل مطابق با انتظارات ما بود. آنها با دقت به نیازهای ما گوش دادند و طراحی را به شکلی انجام دادند که هم از نظر بصری و هم عملکردی عالی باشد.",
    name: "حمید حسینی",
    sitename: "نیاز گستران ",
  },

  {
    id: 8,
    title: "ایده‌های خلاقانه",
    comment:
      "طراحی سایت با ایده‌های خلاقانه و نوآورانه تیم، به نتیجه‌ای فوق‌العاده رسید. سایت نهایی مدرن و جذاب بود و همکاری با این تیم یکی از بهترین تجربیات ما بود.",
    name: "مهدی کرمی",
    sitename: "فروشگاه لوازم خانگی",
  },

  {
    id: 12,
    title: "بینظیر هستند",
    comment:
      "طراحی سایت با سرعت و کیفیت بسیار بالا انجام شد. تیم به تمام نیازها و خواسته‌های ما توجه کرد و طراحی نهایی بسیار جذاب و کاربرپسند بود. روند کار بسیار روان و بدون مشکل بود.",
    name: "سعید نیک‌پور",
    sitename: "سایت پلیمر پرگاس",
  },
];

export const infointroslider = [
  {
    id: 1,
    img: "https://png.pngtree.com/png-clipart/20231115/original/pngtree-shopper-girl-lifestyle-flying-photo-png-image_13567112.png",
    titr: "سفارش طراحی سایت فروشگاهی",
    info: `سفارش طراحی سایت فروشگاهی ارزان و با کیفیت در تهران و سراسر ایران به کسب‌وکارها این امکان را می‌دهد تا با هزینه کم، یک فروشگاه آنلاین حرفه‌ای و کارآمد ایجاد کنند`,
  },
  {
    id: 2,
    img: "https://www.nicepng.com/png/full/253-2532179_our-company-company.png",
    titr: "سفارش طراحی سایت شرکتی",
    info: `سفارش طراحی سایت شرکتی ارزان به کسب‌وکارها این امکان را می‌دهد تا با کمترین هزینه، یک وب‌سایت حرفه‌ای و تاثیرگذار داشته باشند. این خدمات شامل طراحی گرافیکی زیبا، بهینه‌سازی برای موتورهای جستجو (SEO)، و ارائه بخش‌های مختلف برای معرفی شرکت و خدمات آن است.`,
  },
];

export const store_design = {
  metatitle: "خرید و سفارش طراحی سایت فروشگاهی ارزان | فقط 6 میلیون تومن",
  titlesec1: "خرید سایت ارزان فروشگاهی با یونیکد",
  undertitlesec1:
    "اگر دنبال خرید سایت فروشگاهی با قیمتی ارزان و طراحی مناسب هستید و میخواهید کسب و کارتان را پر رونق کنید شرکت یونیکد میتواند به شما در طراحی سایت ارزان فروشگاهی یاری نماید.",
  titleh1: "سفارش طراحی سایت فروشگاهی ارزان و با کیفیت در تهران و سراسر ایران",
  keywords:
    "طراحی سایت ارزان ، خرید سایت ارزان ، طراحی سایت شرکتی ارزان ، طراحی سایت فروشگاهی ارزان ، طراحی سایت شخصی رزومه ای ارزان ، سفارش طراحی سایت ارزان ، خرید سایت فروشگاهی",

  undertitleh1:
    "سفارش طراحی سایت فروشگاهی ارزان و با کیفیت در تهران و سراسر ایران به کسب‌وکارها این امکان را می‌دهد تا با هزینه کم، یک فروشگاه آنلاین حرفه‌ای و کارآمد ایجاد کنند. این خدمات شامل طراحی رابط کاربری جذاب، بهینه‌سازی برای موتورهای جستجو (SEO)، و امکانات متنوع پرداخت آنلاین است. همچنین، پشتیبانی و مشاوره تخصصی در طول فرایند توسعه و پس از آن، تضمین‌کننده موفقیت و رضایت مشتریان است. طراحی سایت فروشگاهی با کیفیت می‌تواند به افزایش فروش و جذب مشتریان جدید کمک کند.",
};

export const company_design = {
  metatitle: "خرید و سفارش طراحی سایت شرکتی ارزان | فقط 4 میلیون تومن",
  keywords:
    "طراحی سایت ارزان ، خرید سایت ارزان ، طراحی سایت شرکتی ارزان ، طراحی سایت فروشگاهی ارزان ، طراحی سایت شخصی رزومه ای ارزان ، سفارش طراحی سایت ارزان ، خرید سایت فروشگاهی",

  titlesec1: "خرید سایت ارزان شرکتی با یونیکد",
  undertitlesec1:
    "با خرید و سفارش طراحی سایت شرکتی میتوانید شرکتتان را به طیف وسیعی از مخاطبین و مشتریان معرفی نمایید و سرعت توسعه شرکت خود را روز به روز بیشتر نمایید.",
  titleh1: "سفارش طراحی سایت شرکتی ارزان و با کیفیت در تهران و سراسر ایران",
  undertitleh1:
    "سفارش طراحی سایت شرکتی ارزان به کسب‌وکارها این امکان را می‌دهد تا با کمترین هزینه، یک وب‌سایت حرفه‌ای و تاثیرگذار داشته باشند. این خدمات شامل طراحی گرافیکی زیبا، بهینه‌سازی برای موتورهای جستجو (SEO)، و ارائه بخش‌های مختلف برای معرفی شرکت و خدمات آن است. با انتخاب این گزینه، شرکت‌ها می‌توانند به سرعت حضور آنلاین خود را تقویت کرده و تعاملات موثرتری با مشتریان و همکاران خود برقرار کنند. این راهکار اقتصادی به ویژه برای شرکت‌هایی که به دنبال بهبود دیده‌شدن و جذب مشتریان جدید هستند، بسیار مناسب است.",
};

export const goodprice_design = {
  metatitle:
    "خرید و سفارش طراحی سایت رزومه ای و شخصی ارزان | فقط 2 میلیون تومن",

  keywords:
    "طراحی سایت ارزان ، خرید سایت ارزان ، طراحی سایت شرکتی ارزان ، طراحی سایت فروشگاهی ارزان ، طراحی سایت شخصی رزومه ای ارزان ، سفارش طراحی سایت ارزان ، خرید سایت فروشگاهی",

  titlesec1: "خرید سایت ارزان و اقتصادی با یونیکد",
  undertitlesec1:
    "اگر به دنبال سایتی برای معرفی خودتان هستید و یا میخواهید سایتی کوچک با امکانات بزرگ راه اندازی نمایید و ایده و تفکر خود را با جامعه بزرگتری از مردم به اشتراک بگذارید یونیکد میتواند شما را در طراحی سایت ارزان اقتصادی و رزومه ای یاری نماید.",
  titleh1:
    "سفارش طراحی سایت اقتصادی و رزومه ای ارزان و با کیفیت در تهران و سراسر ایران",
  undertitleh1:
    "سفارش طراحی سایت رزومه و اقتصادی به معنای درخواست طراحی وبسایتی است که هم برای ارائه رزومه شخصی یا حرفه‌ای کاربرد دارد و هم از لحاظ هزینه‌ها و بهره‌وری اقتصادی بهینه باشد. چنین سایتی معمولاً شامل بخش‌هایی برای معرفی سوابق تحصیلی، تجربیات کاری، مهارت‌ها و نمونه‌کارها می‌باشد و با استفاده از قالب‌های ساده و کارآمد، با هزینه کمتری طراحی و پیاده‌سازی می‌شود. هدف از این طراحی، ایجاد یک بستر حرفه‌ای و مقرون به صرفه برای معرفی توانمندی‌ها و جذب فرصت‌های شغلی یا تجاری است.",
};
