import { notFound } from "next/navigation";

export async function getPosts() {
  let res = await fetch(`http://localhost:3000/api/posts`);
  let post = await res.json();
  if (!post) notFound();
  return post;
}
export const whyusdata = {
  maindata: {
    title: "سفارش طراحی سایت ارزان و با کیفیت در سراسر تهران و ایران",
    content:
      "شرکت یونیکد با افتخار خدمات سفارش طراحی سایت ارزان را به مشتریان خود ارائه می‌دهد. اگر به دنبال یک طراحی حرفه‌ای و باکیفیت با قیمت مناسب هستید، یونیکد بهترین گزینه برای شماست. تیم ما متشکل از طراحان و برنامه‌نویسان با تجربه است که با استفاده از آخرین فناوری‌ها و استانداردهای روز، وب‌سایتی منحصر به فرد و کاربرپسند برای شما طراحی می‌کنند.",
    img: "/image/design-team.jpg",
  },
  storedata: [
    {
      title: "طراحی سایت فروشگاهی",
      content:
        "یونیکد تخصص ویژه‌ای در طراحی سایت‌های فروشگاهی دارد. ما با ارائه پلتفرم‌هایی که کاربری آسان دارند و قابلیت‌های پرداخت آنلاین، به شما کمک می‌کنیم تا کسب و کار خود را به راحتی به دنیای دیجیتال منتقل کنید. طراحی‌های ما همواره واکنش‌گرا بوده و بهترین تجربه کاربری را به مشتریان شما ارائه می‌دهد.",
      img: "/image/eCommerce-website-developer.jpg",
    },
  ],
  companydata: [
    {
      title: "طراحی سایت شرکتی",
      content:
        "سایت‌های شرکتی طراحی شده توسط یونیکد، برند شما را به بهترین شکل ممکن نمایش می‌دهند. از ویژگی‌های منحصر به فرد طراحی‌های ما می‌توان به واکنش‌گرایی، بهینه‌سازی برای موتورهای جستجو و امنیت بالا اشاره کرد. طراحی سایت شرکتی خود را به ما بسپارید و از نتایج فوق‌العاده لذت ببرید.",
      img: "/image/companywebdesign.jpg",
    },
  ],
  resumedata: [
    {
      title: "طراحی سایت شخصی و رزومه‌ای",
      content:
        "اگر به دنبال نمایش توانمندی‌ها و مهارت‌های خود به صورت آنلاین هستید، یونیکد با طراحی سایت‌های شخصی و رزومه‌ای حرفه‌ای، به شما کمک می‌کند تا هویت آنلاین خود را به بهترین شکل ممکن بسازید. سایت‌هایی که برای شما طراحی می‌کنیم سریع، امن و کاملاً بهینه برای موتورهای جستجو هستند.",
      img: "/image/resumeweb.jpg",
    },
  ],
};
